<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Konversi nilai numerik ke dalam kategori pada Data Frame**

___

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [4]:
n_rows = 10
n_cols = 1

cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), columns=cols)

df

   usia
0    43
1    48
2    45
3    96
4    53
5    46
6    71
7    94
8    12
9    94

Pengelompokan Nilai Numerik Berdasarkan Kategori Menggunakan cut( )

In [6]:
df['kelompok_usia'] = pd.cut(df['usia'],
                             bins = [0, 18, 65, 99],
                             labels = ['anak', 'dewasa', 'lansia'])

#usia anak = 0 - 18
#usia dewasa = 18 - 65
#usia lansia = 65 - 99

df

   usia kelompok_usia
0    43        dewasa
1    48        dewasa
2    45        dewasa
3    96        lansia
4    53        dewasa
5    46        dewasa
6    71        lansia
7    94        lansia
8    12          anak
9    94        lansia